In [97]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",$3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,$1.56
2,2,Ithergue48,24,Male,92,Final Critic,$4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,$3.27
4,4,Iskosia90,23,Male,131,Fury,$1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,$3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,$1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",$3.46
778,778,Sisur91,7,Male,92,Final Critic,$4.19
779,779,Ennrian78,24,Male,50,Dawn,$4.60

In [98]:
### Check for missing data
purchase_data_df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [99]:
pcount = purchase_data_df['SN'].nunique()
pcount

576

# Player Count & Revenue

In [100]:

pcount = purchase_data_df['SN'].value_counts()
pcount

Lisosia93      5
Idastidru52    4
Iral74         4
Iri67          3
Phyali88       3
              ..
Quilassa66     1
Haisurra41     1
Assilsan72     1
Iskosian40     1
Chadirra90     1
Name: SN, Length: 576, dtype: int64

In [101]:
### Player Count convert into dataframe
pcount2_df = pd.DataFrame(pcount)
pcount2_df

             SN
Lisosia93     5
Idastidru52   4
Iral74        4
Iri67         3
Phyali88      3
...          ..
Quilassa66    1
Haisurra41    1
Assilsan72    1
Iskosian40    1
Chadirra90    1

[576 rows x 1 columns]

In [102]:
### Purchasing Analysis (Number of Unique Items)
count = purchase_data_df["Item Name"].value_counts()
len(count)

179

In [103]:
### Average Purchase Price

average = purchase_data_df["Price"].mean()
average.round(decimals=2)

3.05

In [104]:
### Total Number of Purchases
total_purchases = purchase_data_df["Purchase ID"].count()
total_purchases

780

In [105]:
### Total Revenue
total_revenue = purchase_data_df["Price"].sum()
total_revenue

2379.77

In [106]:
### Table of items above viewed together
purchasing_analysis = pd.DataFrame({"Total Number of Players":[len(pcount)],
    "Number of Unique Items":[len(count)],
                                    "Average Purchase Price":[average.round(decimals=2)],
                                    "Total Number of Purchases":[total_purchases],
                                    "Total Revenue":[total_revenue]})
purchasing_analysis['Total Revenue'] = purchasing_analysis['Total Revenue'].map('${:,.2f}'.format)
purchasing_analysis['Average Purchase Price'] = purchasing_analysis['Average Purchase Price'].map('${:,.2f}'.format)
purchasing_analysis

,Total Number of Players,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,576,179,$3.05,780,"$2,379.77"

# Gender Demographics

In [107]:
male_gender_df = purchase_data_df.loc[purchase_data_df['Gender'] == 'Male',]
male_gender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",$3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,$1.56
2,2,Ithergue48,24,Male,92,Final Critic,$4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,$3.27
4,4,Iskosia90,23,Male,131,Fury,$1.44

In [108]:
#extract Gender and SN column
gender_group_df = purchase_data_df[['Gender', 'SN']]
gender_group_df

     Gender             SN
0      Male        Lisim78
1      Male    Lisovynya38
2      Male     Ithergue48
3      Male  Chamassasya86
4      Male      Iskosia90
..      ...            ...
775  Female     Aethedru70
776    Male         Iral74
777    Male     Yathecal72
778    Male        Sisur91
779    Male      Ennrian78

[780 rows x 2 columns]

In [109]:

gender_group2_df = gender_group_df.groupby(['Gender'])
gender_group2_df

In [110]:
gender_group2_df['SN'].count
gender_group2_df.head()

                    Gender             SN
0                     Male        Lisim78
1                     Male    Lisovynya38
2                     Male     Ithergue48
3                     Male  Chamassasya86
4                     Male      Iskosia90
9    Other / Non-Disclosed    Chanosian48
15                  Female      Lisassa64
18                  Female      Reunasu60
22   Other / Non-Disclosed   Siarithria38
38                  Female       Reulae52
41                  Female      Assosia88
55                  Female      Phaelap26
82   Other / Non-Disclosed     Haerithp41
111  Other / Non-Disclosed       Sundim98
228  Other / Non-Disclosed    Jiskirran77

In [111]:
#amount of male
male_gender_count = male_gender_df["SN"].value_counts()
len(male_gender_count)

484

In [112]:
#amount of female
female_gender_df = purchase_data_df.loc[purchase_data_df['Gender'] == 'Female',]
female_gender_df.head()
female_gender_count = female_gender_df["SN"].value_counts()
len(female_gender_count)

81

In [113]:
#dataframe for other
other_gender_df = purchase_data_df.loc[purchase_data_df['Gender'] == 'Other / Non-Disclosed',]
other_gender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,$3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,$3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,$4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,$4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,$3.39

In [114]:
#amount of Other
other_gender_count = other_gender_df["SN"].value_counts()
len(other_gender_count)

11

In [115]:
### Add gender counts & percentages to a dataframe
raw_count = {
    'Total Count':[len(male_gender_count), len(female_gender_count), len(other_gender_count)],
    'Percentage of Players':[len(male_gender_count)/576*100, 
                             len(female_gender_count)/576*100, 
                             len(other_gender_count)/576*100]   
} 

gender_df = pd.DataFrame(raw_count, index=['Male', 'Female', 'Other / Non-Disclosed'],
                         columns=[
    'Total Count', 'Percentage of Players'])
gender_df

gender_df['Percentage of Players'] = gender_df['Percentage of Players'].map('{:,.2f}%'.format)



gender_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

# Purchasing Analysis (Gender)

In [116]:
puranalysis_cnt = purchase_data_df.groupby(['Gender'])['Price'].count()
puranalysis_cnt

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [117]:
# grouped_counts = purchase_data_df.groupby(['Gender'])
# print(grouped_counts)
# grouped_counts.count().head(3)

In [118]:
### Add Purchasing Analysis to a dataframe
puranalysis_cnt = purchase_data_df.groupby(['Gender'])['Price'].count()
puranalysis_avg = purchase_data_df.groupby(['Gender'])['Price'].mean()
puranalysis_total = purchase_data_df.groupby(['Gender'])['Price'].sum()
puranalysis_gender_cnt = purchase_data_df.drop_duplicates(subset='SN')['Gender'].value_counts()
                                         
avg_purchase = puranalysis_total/ puranalysis_gender_cnt
                                           
puranalysis_df = pd.DataFrame({
    'Purchase Count': puranalysis_cnt,
    'Average Purchase Price': puranalysis_avg,
    'Total Purchase Value': puranalysis_total,
    'Avg Total Purchase per Person': avg_purchase
})

puranalysis_df['Average Purchase Price'] = puranalysis_df['Average Purchase Price'].map('${:,.2f}'.format)
puranalysis_df['Total Purchase Value'] = puranalysis_df['Total Purchase Value'].map('${:,.2f}'.format)
puranalysis_df['Avg Total Purchase per Person'] = puranalysis_df['Avg Total Purchase per Person'].map('${:,.2f}'.format)

puranalysis_df.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

#  Age Demographics

In [119]:
#Create the bins
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 200 ]
age_labels = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [120]:
# #drop duplicates
unique_sn_df = purchase_data_df.drop_duplicates(subset='SN')['Age'].to_frame()
unique_sn_df.head(780)

     Age
0     20
1     40
2     24
3     24
4     23
..   ...
773   21
774   11
775   21
777   20
778    7

[576 rows x 1 columns]

In [121]:
#categorize existing players into bins
unique_sn_df ['Age Summary'] = pd.cut(unique_sn_df['Age'], bins, labels=age_labels)
unique_sn_df

     Age Age Summary
0     20       20-24
1     40         40+
2     24       20-24
3     24       20-24
4     23       20-24
..   ...         ...
773   21       20-24
774   11       10-14
775   21       20-24
777   20       20-24
778    7         <10

[576 rows x 2 columns]

In [122]:
#count number of SN in each bin without duplicates 
age_demo = unique_sn_df['Age Summary'].value_counts()
age_demo

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Summary, dtype: int64

In [123]:
age_demo_calc_df = pd.DataFrame(age_demo)
age_demo_calc_df

       Age Summary
20-24          258
15-19          107
25-29           77
30-34           52
35-39           31
10-14           22
<10             17
40+             12

In [124]:
total=age_demo_calc_df ['Age Summary'].sum()
total

576

In [125]:
age_demo_calc_df['Percentage of Players'] = round((age_demo_calc_df['Age Summary']/ total)*100, 2).map('{:,.2f}%'.format)
age_demo_calc_df

       Age Summary Percentage of Players
20-24          258                44.79%
15-19          107                18.58%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
10-14           22                 3.82%
<10             17                 2.95%
40+             12                 2.08%

In [126]:
final_age_demo_calc_df = age_demo_calc_df.rename(columns={'Age Summary':'Total Count'})
final_age_demo_calc_df

       Total Count Percentage of Players
20-24          258                44.79%
15-19          107                18.58%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
10-14           22                 3.82%
<10             17                 2.95%
40+             12                 2.08%

In [127]:
final_age_demo_calc_df.sort_index()

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

# Purchasing Analysis (Age)

In [128]:
age_price_df = purchase_data_df.loc[:, ["Age", "Price", "SN"]]
age_price_df

     Age  Price             SN
0     20  $3.53        Lisim78
1     40  $1.56    Lisovynya38
2     24  $4.88     Ithergue48
3     24  $3.27  Chamassasya86
4     23  $1.44      Iskosia90
..   ...    ...            ...
775   21  $3.54     Aethedru70
776   21  $1.63         Iral74
777   20  $3.46     Yathecal72
778    7  $4.19        Sisur91
779   24  $4.60      Ennrian78

[780 rows x 3 columns]

In [129]:
age_price_df["Age Ranges"] = pd.cut(purchase_data_df["Age"], bins, labels=age_labels)
age_price_df

     Age  Price             SN Age Ranges
0     20  $3.53        Lisim78      20-24
1     40  $1.56    Lisovynya38        40+
2     24  $4.88     Ithergue48      20-24
3     24  $3.27  Chamassasya86      20-24
4     23  $1.44      Iskosia90      20-24
..   ...    ...            ...        ...
775   21  $3.54     Aethedru70      20-24
776   21  $1.63         Iral74      20-24
777   20  $3.46     Yathecal72      20-24
778    7  $4.19        Sisur91        <10
779   24  $4.60      Ennrian78      20-24

[780 rows x 4 columns]

In [130]:
age_demographics_cnts = age_price_df.groupby(["Age Ranges"])["SN"].nunique()
age_demographics_cnts

Age Ranges
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [131]:
columns = ["Purchase Count","Average Purchase Price", "Total Purchase Value", "Avg Total Purchase per Person"]

age_purchase_df = pd.DataFrame(columns=columns)

In [132]:
age_purchase_df["Purchase Count"] = age_price_df.groupby(["Age Ranges"])["Price"].count()
age_purchase_df["Average Purchase Price"] = age_price_df.groupby(["Age Ranges"])["Price"].mean() 
age_purchase_df["Total Purchase Value"] = age_price_df.groupby(["Age Ranges"])["Price"].sum() 
age_purchase_df["Avg Total Purchase per Person"] = age_price_df.groupby(["Age Ranges"])["Price"].sum()/age_demographics_cnts

pd.options.display.float_format='${:,.2f}'.format
age_purchase_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

# Top Spenders

In [151]:
# purchase_sum = purchase_data_df.groupby(['SN'])['Price'].sum()
# purchase_sum
#purchase_avg = purchase_data_df.groupby(['SN'])['Price'].mean()
#purchase_avg
purchase_count = purchase_data_df.groupby(['SN'])['Price'].count()
purchase_count
# spenders_df = pd.DataFrame({
#     'Purchase Count':purchase_count,
#     'Average Purchase Price':purchase_avg,
#     'Total Purchase Value':purchase_sum
# })
# spenders_df

# spenders_df = purchase_data_df.sort_values(purchase_sum, ascending=False)
# spenders_df

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [149]:
purchase_sum = purchase_data_df.groupby(['SN'])['Price'].sum()
purchase_sum

SN
Adairialis76    $2.28
Adastirin33     $4.48
Aeda94          $4.91
Aela59          $4.32
Aelaria33       $1.79
                 ...
Yathecal82      $6.22
Yathedeu43      $6.02
Yoishirrala98   $4.58
Zhisrisu83      $7.89
Zontibe81       $8.03
Name: Price, Length: 576, dtype: float64

In [150]:
purchase_avg = purchase_data_df.groupby(['SN'])['Price'].mean()
purchase_avg

SN
Adairialis76    $2.28
Adastirin33     $4.48
Aeda94          $4.91
Aela59          $4.32
Aelaria33       $1.79
                 ...
Yathecal82      $2.07
Yathedeu43      $3.01
Yoishirrala98   $4.58
Zhisrisu83      $3.94
Zontibe81       $2.68
Name: Price, Length: 576, dtype: float64

In [169]:
spenders_df = pd.DataFrame({
     'Purchase Count':purchase_count,
     'Average Purchase Price':purchase_avg,
     'Total Purchase Value':purchase_sum
 })
spenders_df
final_spenders_df = spenders_df.sort_values(by='Total Purchase Value', ascending=False)
final_spenders_df

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                   $3.79                $18.96
Idastidru52               4                   $3.86                $15.45
Chamjask73                3                   $4.61                $13.83
Iral74                    4                   $3.40                $13.62
Iskadarya95               3                   $4.37                $13.10
...                     ...                     ...                   ...
Ililsasya43               1                   $1.02                 $1.02
Irilis75                  1                   $1.02                 $1.02
Aidai61                   1                   $1.01                 $1.01
Chanirra79                1                   $1.01                 $1.01
Alo38                     1                   $1.00                 $1.00

[576 rows x 3 columns]

In [170]:
final_spenders_df['Average Purchase Price'] = final_spenders_df['Average Purchase Price'].map("${:,.2f}".format)
final_spenders_df['Total Purchase Value'] = final_spenders_df['Total Purchase Value'].map("${:,.2f}".format)
final_spenders_df = final_spenders_df.loc[:, ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']]

final_spenders_df.head(5)

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

# Most Popular Items

In [178]:
# Item ID	Item Name	Price

# # #drop duplicates
# unique_sn_df = purchase_data_df.drop_duplicates(subset='SN')['Age'].to_frame()
# unique_sn_df.head(780)


pop_items_df = purchase_data_df[['Item ID', 'Item Name', 'Price']]
pop_items_df

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands  $3.53
1        143                          Frenzied Scimitar  $1.56
2         92                               Final Critic  $4.88
3        100                                Blindscythe  $3.27
4        131                                       Fury  $1.44
..       ...                                        ...    ...
775       60                                       Wolf  $3.54
776      164                           Exiled Doomblade  $1.63
777       67      Celeste, Incarnation of the Corrupted  $3.46
778       92                               Final Critic  $4.19
779       50                                       Dawn  $4.60

[780 rows x 3 columns]

In [181]:
group_pop_items_sum = pop_items_df.groupby(['Item ID','Item Name'])['Price'].sum()
group_pop_items_count = pop_items_df.groupby(['Item ID','Item Name'])['Price'].count()
group_pop_items_avg = pop_items_df.groupby(['Item ID','Item Name'])['Price'].mean()

group_pop_summary_df = pd.DataFrame({
    'Purchase Count': group_pop_items_count,
    
    'Item Price': group_pop_items_avg,
    'Total Purchase Value': group_pop_items_sum
})

group_pop_summary_df

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,$1.28,$5.12
1,Crucifer,4,$2.94,$11.77
2,Verdict,6,$2.48,$14.88
3,Phantomlight,6,$2.49,$14.94
4,Bloodlord's Fetish,5,$1.70,$8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
179,"Wolf, Promise of the Moonwalker",6,$4.48,$26.88
181,Reaper's Toll,5,$1.66,$8.30
182,Toothpick,3,$4.03,$12.09
183,Dragon's Greatsword,3,$1.09,$3.27

In [183]:
sort_group_pop_summary_df = group_pop_summary_df.sort_values('Purchase Count', ascending=False)
sort_group_pop_summary_df.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

# Most Profitable Items

In [ ]:
sort_group_prof_summary_df = group_pop_summary_df.sort_values('Purchase Count', ascending=False)
sort_group_prof_summary_df.head(5)

In [33]:
# Finally, export this file to a spread so we can keep track of out new future watch list without the index
# unknown_movies_df.to_excel("output/movieWatchlist.xlsx", index=False)